### Forest: Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=c9ca5c42-20b0-11ee-a1b6-0a58ac14d27b]
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=364831816]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=ae340e6f-ab29-43c3-a50b-8e52c8035e2a]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=364831816-c9ca5c42-20b0-11ee-a1b6-0a58ac14d27b-20230712123809306100000001]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-07-12T12:36:56Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "364831816" -> (known after apply)
      ~ ipv4_address         = "161.35.71.199" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:364831816" -> (known after apply)
      ~ user_data            = "644a172001b768595d7a84427fd549a184c0d564" -> "5b461f4a9484c097489c3b53fbd37439112eb701" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "c9ca5c42-20b0-11ee-a1b6-0a58ac14d27b",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 364831816,
        ] -> (known after apply)
        id              = "ae340e6f-ab29-43c3-a50b-8e52c8035e2a"
        name            = "forest-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:364831816",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 364831816 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "364831816-c9ca5c42-20b0-11ee-a1b6-0a58ac14d27b-20230712123809306100000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>